cases/chpt4-tin-solid-507-sol/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    top
    {
        type            calculated;
        value           $internalField;
    }
    btm
    {
        type            calculated;
        value           $internalField;
    }
    cold
    {
        type            calculated;
        value           $internalField;
    }
    hot
    {
        type            calculated;
        value           $internalField;
    }
    frontAndBack
    {
        type empty;
    }
    hotTop
    {
        $hot;
    }
    coldTop
    {
        $cold;
    }
}

// ************************************************************************* //
